{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      "GGC": 4,
      "GCG": 5,
      "CTG": 6,
      "GCC": 7,
      "GAG": 8,
      "GTG": 9,
      "CAG": 10,
      "GAC": 11,
      "AAG": 12,
      "CGC": 13,
      "AGC": 14,
      "CCG": 15,
      "GCT": 16,
      "GCA": 17,
      "ATG": 18,
      "CCC": 19,
      "CGG": 20,
      "ACC": 21,
      "TTC": 22,
      "AAC": 23,
      "GGG": 24,
      "ACG": 25,
      "CTC": 26,
      "GTC": 27,
      "TCG": 28,
      "CAC": 29,
      "ATC": 30,
      "TCC": 31,
      "TGC": 32,
      "TAC": 33,
      "TGG": 34,
      "CCA": 35,
      "GGT": 36,
      "GAT": 37,
      "CCT": 38,
      "GGA": 39,
      "CTT": 40,
      "CAA": 41,
      "ACA": 42,
      "TTG": 43,
      "GTT": 44,
      "GAA": 45,
      "TCA": 46,
      "ATT": 47,
      "TCT": 48,
      "CGT": 49,
      "ACT": 50,
      "TTT": 51,
      "AGG": 52,
      "CTA": 53,
      "AAA": 54,
      "CAT": 55,
      "CGA": 56,
      "AGT": 57,
      "AAT": 58,
      "TAT": 59,
      "GTA": 60,
      "TGT": 61,
      "ATA": 62,
      "AGA": 63,
      "TTA": 64,
      "TGA": 65,
      "TAG": 66,
      "TAA": 67,
      "NNN": 68
    },
    "unk_token": "[UNK]"
  }
}